Repository: Ajimaru/OctoPrint-TempETA
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: de

source: Adjust the algorithm, threshold, and update interval above to tune the ETA calculation for your printer.
de: Passe oben Algorithmus, Schwelle und Aktualisierungsintervall an, um die ETA-Berechnung für deinen Drucker abzustimmen.

source: Adjust the sound alert volume.
de: Lautstärke der Sound-Alarme einstellen.

source: Adjust the time window in Settings → Temperature ETA.
de: Passe das Zeitfenster unter Einstellungen → Temperatur-ETA an.

source: Algorithms
de: Algorithmen

source: Ambient temperature (optional)
de: Umgebungstemperatur (optional)

source: Ambient-based target
de: Umgebungsbasiertes Ziel

source: Assumes a roughly constant heating rate over the recent samples. Best for quick, stable estimates and slower/steady heaters.
de: Geht von einer annähernd konstanten Heizrate über die letzten Messwerte aus. Am besten für schnelle, stabile Schätzungen und langsamere/gleichmäßige Heizer.

source: Base MQTT topic for publishing. Messages will be published to {base_topic}/{heater}/eta and {base_topic}/{heater}/state_change
de: Basis-MQTT-Topic für die Veröffentlichung. Nachrichten werden unter {base_topic}/{heater}/eta und {base_topic}/{heater}/state_change veröffentlicht

source: Base Topic
de: Basis-Topic

source: Browser notifications
de: Browser-Benachrichtigungen

source: Calculates heating rate (°C/second)
de: Berechnet die Heizrate (°C/Sekunde)

source: Calculation Algorithm
de: Berechnungsalgorithmus

source: Choose which events should play a sound alert.
de: Wähle, welche Ereignisse einen Sound abspielen sollen.

source: Choose which events should show a browser notification.
de: Wähle, welche Ereignisse eine Browser-Benachrichtigung anzeigen sollen.

source: Color mode
de: Farbmodus

source: Configure algorithm and threshold in Settings → Temperature ETA
de: Algorithmus und Schwellwert unter Einstellungen → Temperatur-ETA konfigurieren

source: Confirm reset
de: Zurücksetzen bestätigen

source: Cool-down fit window (seconds)
de: Cool-Down-Fit-Fenster (Sekunden)

source: Cool-down hysteresis (°C)
de: Cool-Down-Hysterese (°C)

source: Cool-down mode
de: Cool-Down-Modus

source: Cool-down target (bed)
de: Cool-Down-Ziel (Bett)

source: Cool-down target (chamber)
de: Cool-Down-Ziel (Chamber)

source: Cool-down target (tool0)
de: Cool-Down-Ziel (Tool0)

source: Cooldown finished
de: Cooldown abgeschlossen

source: Cooling color
de: Abkühlfarbe

source: Defaults restored.
de: Standardeinstellungen wiederhergestellt.

source: Deleted persisted history for all profiles ({count} file(s)).
de: Gespeicherte Historie für alle Profile gelöscht ({count} Datei(en)).

source: Deletes all persisted ETA history JSON files for all printer profiles (stored in OctoPrint's plugin data folder).
de: Löscht alle gespeicherten ETA-Historien (JSON) für alle Druckerprofile (gespeichert im OctoPrint-Plugin-Datenordner).

source: Displays countdown in MM:SS format
de: Zeigt den Countdown im Format MM:SS an

source: ETAs are only shown when the target temperature is above the current temperature and the configured threshold is met.
de: ETAs werden nur angezeigt, wenn die Zieltemperatur über der aktuellen Temperatur liegt und die konfigurierte Schwelle erfüllt ist.

source: Enable MQTT
de: MQTT aktivieren

source: Enable MQTT integration to publish temperature ETA data and state changes.
de: MQTT-Integration aktivieren, um Temperatur-ETA-Daten und Statusänderungen zu veröffentlichen.

source: Enable MQTT retain flag (new subscribers receive last message)
de: MQTT-Retain-Flag aktivieren (neue Abonnenten erhalten die letzte Nachricht)

source: Enable TLS/SSL encryption for MQTT connection
de: TLS/SSL-Verschlüsselung für die MQTT-Verbindung aktivieren

source: Enable Temperature ETA
de: Temperatur-ETA aktivieren

source: Enable browser notifications
de: Browser-Benachrichtigungen aktivieren

source: Enable cool-down ETA
de: Cool-Down-ETA aktivieren

source: Enable debug logging
de: Debug-Logging aktivieren

source: Enable heating ETA
de: Heiz-ETA aktivieren

source: Enable or disable the Temperature ETA plugin and all of its features.
de: Aktiviert oder deaktiviert das Temperatur-ETA-Plugin und alle seine Funktionen.

source: Enable sound alerts
de: Sound-Alarme aktivieren

source: Estimates time to reach target temperature
de: Schätzt die Zeit bis zur Zieltemperatur

source: Events
de: Ereignisse

source: Exponential
de: Exponentiell

source: Follow temperature display
de: Temperaturanzeige übernehmen

source: General
de: Allgemein

source: Heating ETA
de: Heiz-ETA

source: Heating color
de: Heizfarbe

source: Heating threshold
de: Heiz-Schwellenwert

source: Help
de: Hilfe

source: Hide ETA while printing
de: ETA während des Drucks ausblenden

source: Historical graph
de: Historischer Graph

source: Historical graph window (seconds)
de: Zeitraum für historischen Graph (Sekunden)

source: Historical temperature graphs
de: Historische Temperaturgrafen

source: History reset completed.
de: Historie wurde zurückgesetzt.

source: How it works
de: So funktioniert es

source: How long a notification stays visible before it disappears automatically.
de: Wie lange eine Benachrichtigung sichtbar bleibt, bevor sie automatisch verschwindet.

source: How many seconds of recent cooldown data to use for the ETA estimate.
de: Wie viele Sekunden an aktuellen Abkühl-Daten für die ETA-Schätzung genutzt werden.

source: How many seconds of temperature history to display (per heater).
de: Wie viele Sekunden Temperaturverlauf angezeigt werden sollen (pro Heizer).

source: How often to update ETA display (lower = more responsive, higher = less CPU)
de: Wie oft die ETA-Anzeige aktualisiert wird (niedriger = reaktionsschneller, höher = weniger CPU)

source: Idle color
de: Leerlauffarbe

source: If disabled: ETA is shown when the temperature difference to the target is at least the heating threshold. If enabled: ETA is only shown when no print job is active.
de: Wenn deaktiviert: ETA wird angezeigt, wenn der Abstand zur Zieltemperatur mindestens dem Heizschwellwert entspricht. Wenn aktiviert: ETA wird nur angezeigt, wenn kein Druckauftrag aktiv ist.

source: If empty, the plugin estimates ambient temperature from recent cooldown data.
de: Wenn leer, schätzt das Plugin die Umgebungstemperatur aus den letzten Abkühl-Daten.

source: If the heating rate cannot be determined (e.g. too little data or temperature jitter), the ETA may stay hidden until it stabilizes.
de: Wenn die Heizrate nicht bestimmt werden kann (z. B. zu wenig Daten oder Temperaturschwankungen), bleibt die ETA ggf. ausgeblendet, bis sie stabil ist.

source: Internally, the calculation uses °C. If you choose °F here, the value will be converted automatically.
de: Intern verwendet die Berechnung °C. Wenn du hier °F auswählst, wird der Wert automatisch umgerechnet.

source: Linear (default)
de: Linear (Standard)

source: Linear: Assumes constant heating rate, simple and fast. Exponential: Accounts for thermal asymptotic behavior, more accurate.
de: Linear: Geht von einer konstanten Heizrate aus – einfach und schnell. Exponentiell: Berücksichtigt das asymptotische thermische Verhalten – genauer.

source: MQTT Quality of Service level
de: MQTT-Quality-of-Service-Stufe

source: MQTT broker hostname or IP address
de: Hostname oder IP-Adresse des MQTT-Brokers

source: MQTT broker port (default: 1883)
de: Port des MQTT-Brokers (Standard: 1883)

source: MQTT password
de: MQTT-Passwort

source: MQTT username (leave empty for no authentication)
de: MQTT-Benutzername (leer lassen für keine Authentifizierung)

source: Maintenance
de: Wartung

source: Minimum interval (seconds)
de: Mindestintervall (Sekunden)

source: Minimum interval between MQTT publishes (default: 1.0 seconds)
de: Mindestintervall zwischen MQTT-Veröffentlichungen (Standard: 1.0 Sekunden)

source: Models the typical slow-down as the heater approaches the target temperature. Best when your heater ramps fast initially but tapers off near the target.
de: Modelliert die typische Verlangsamung, wenn sich der Heizer der Zieltemperatur nähert. Am besten, wenn der Heizer anfangs schnell ansteigt, aber nahe am Ziel abflacht.

source: Monitors temperature changes in real-time
de: Überwacht Temperaturänderungen in Echtzeit

source: No persisted history files found.
de: Keine gespeicherten Historie-Dateien gefunden.

source: Notes
de: Hinweise

source: Number of temperature samples to keep in history
de: Anzahl der Temperaturmesswerte, die im Verlauf gespeichert werden

source: OctoPrint API not available.
de: OctoPrint-API nicht verfügbar.

source: Optional alerts (sound/toast) can notify you when the target is reached or when the cool-down finishes.
de: Optionale Alarme (Sound/Toast) können dich benachrichtigen, wenn das Ziel erreicht ist oder wenn der Cool-down abgeschlossen ist.

source: Password
de: Passwort

source: Play test sound
de: Testton abspielen

source: Plays a short test sound using the current volume setting.
de: Spielt einen kurzen Testton mit der aktuellen Lautstärke ab.

source: Please enter a valid number.
de: Bitte eine gültige Zahl eingeben.

source: Please enter a value between {min} and {max}.
de: Bitte einen Wert zwischen {min} und {max} eingeben.

source: Please enter a value of at least {min}.
de: Bitte einen Wert von mindestens {min} eingeben.

source: Please enter a value of at most {max}.
de: Bitte einen Wert von höchstens {max} eingeben.

source: Please fix the highlighted settings values before saving.
de: Bitte korrigiere die hervorgehobenen Einstellungswerte, bevor du speicherst.

source: Publish Interval (seconds)
de: Veröffentlichungsintervall (Sekunden)

source: Quality of Service (QoS)
de: Dienstgüte (QoS)

source: Rate limit to avoid repeated beeps due to small target/temperature jitter.
de: Begrenzt die Häufigkeit, um wiederholte Pieptöne durch kleine Schwankungen von Ziel/Temperatur zu vermeiden.

source: Rate limit to avoid repeated notifications due to small target/temperature jitter.
de: Begrenzt die Häufigkeit, um wiederholte Benachrichtigungen durch kleine Schwankungen von Ziel/Temperatur zu vermeiden.

source: Real-time Countdown
de: Echtzeit-Countdown

source: Really delete all persisted ETA history JSON files for all printer profiles?
de: Wirklich alle gespeicherten ETA-Historien (JSON) für alle Druckerprofile löschen?

source: Reset
de: Zurücksetzen

source: Reset failed.
de: Zurücksetzen fehlgeschlagen.

source: Reset profile history
de: Profil-Historie zurücksetzen

source: Restore
de: Wiederherstellen

source: Restore all Temperature ETA settings to their default values?
de: Alle Temperature-ETA-Einstellungen auf Standardwerte zurücksetzen?

source: Restore defaults
de: Standards wiederherstellen

source: Restore defaults failed.
de: Wiederherstellen der Standardwerte fehlgeschlagen.

source: Restores Temperature ETA settings to their default values.
de: Stellt die Temperature-ETA-Einstellungen auf Standardwerte zurück.

source: Retain Messages
de: Retain-Nachrichten

source: Show ETA in OctoPrint's sidebar temperature widget.
de: Zeigt die ETA im OctoPrint-Seitenleisten-Temperaturwidget.

source: Show ETA in the dedicated Temperature ETA tab.
de: Zeigt die ETA im eigenen Temperatur-ETA-Tab.

source: Show ETA in the top navigation bar.
de: Zeigt die ETA in der oberen Navigationsleiste.

source: Show a small temperature history graph in the Temperature ETA tab.
de: Einen kleinen Temperatur-Verlaufsgraph im Temperature-ETA-Tab anzeigen.

source: Show an estimated time to cool down when no target temperature is set.
de: Zeigt eine geschätzte Abkühlzeit, wenn keine Zieltemperatur gesetzt ist.

source: Show an estimated time to reach the target temperature while heating.
de: Zeigt eine geschätzte Zeit bis zur Zieltemperatur während des Aufheizens.

source: Show heating progress bars in the sidebar and tab views.
de: Heiz-Fortschrittsbalken in Sidebar und Tab anzeigen.

source: Show historical graph
de: Historischen Graph anzeigen

source: Show in navbar
de: In der Navbar anzeigen

source: Show in sidebar
de: In der Sidebar anzeigen

source: Show in tab
de: Im Tab anzeigen

source: Show progress bars
de: Fortschrittsbalken anzeigen

source: Show small toast notifications in the top-right corner of the OctoPrint UI.
de: Zeigt kleine Toast-Benachrichtigungen oben rechts in der OctoPrint-Oberfläche.

source: Shows recent temperature history for each heater.
de: Zeigt den aktuellen Temperaturverlauf für jedes Heizelement.

source: Skip TLS certificate verification
de: TLS-Zertifikatsprüfung überspringen

source: Skip certificate verification (not recommended for production)
de: Zertifikatsprüfung überspringen (für Produktion nicht empfohlen)

source: Some browsers require a user interaction before sound can play. Use the Test button to grant permission.
de: Einige Browser benötigen eine Nutzerinteraktion, bevor Sound abgespielt werden kann. Nutze die Schaltfläche „Test“, um die Berechtigung zu erteilen.

source: Sound alerts
de: Sound-Alarme

source: Start ETA when target is this many degrees away
de: ETA anzeigen, wenn Zieltemperatur um diesen Wert entfernt ist

source: Status colors
de: Statusfarben

source: Status colors (heating/cooling/idle)
de: Statusfarben (Heizen/Abkühlen/Leerlauf)

source: Stop showing Cool-down ETA when within this temperature band of the cool-down target.
de: Blendet die Cool-Down-ETA aus, sobald die Temperatur innerhalb dieses Bereichs um das Cool-Down-Ziel liegt.

source: Supported heaters depend on your firmware and OctoPrint: tool0, bed, and chamber (if available).
de: Unterstützte Heizelemente hängen von Firmware und OctoPrint ab: tool0, bed und chamber (falls verfügbar).

source: Target reached
de: Ziel erreicht

source: Target temperature for the bed when using threshold mode.
de: Zieltemperatur für das Bett im Schwellwert-Modus.

source: Target temperature for the chamber when using threshold mode.
de: Zieltemperatur für die Kammer im Schwellwert-Modus.

source: Target temperature for tool0 when using threshold mode.
de: Zieltemperatur für Tool0 im Schwellwert-Modus.

source: Temperature ETA
de: Temperatur-ETA

source: Temperature ETA Monitor
de: Temperatur-ETA Monitor

source: Temperature ETA Settings
de: Temperatur-ETA

source: Temperature History Size
de: Größe der Temperatur-Historie

source: Temperature display
de: Temperaturanzeige

source: This usually means an ETA is not available yet. Common reasons: the target is not high enough above the current temperature, the heating threshold is not met, or there is not enough stable data to calculate a rate.
de: Das bedeutet meistens, dass noch keine ETA verfügbar ist. Häufige Gründe: Die Zieltemperatur liegt nicht hoch genug über der aktuellen Temperatur, der Heizschwellwert ist nicht erreicht oder es gibt noch nicht genug stabile Daten, um eine Rate zu berechnen.

source: Threshold target (default)
de: Schwellwert-Ziel (Standard)

source: Threshold unit
de: Einheit der Schwelle

source: Threshold: cool down to a fixed target per heater. Ambient: cool down close to ambient temperature (uses an ambient value if set, otherwise estimates from recent data).
de: Schwellwert: Abkühlen bis zu einem festen Ziel pro Heizer. Umgebung: Abkühlen bis nahe an die Umgebungstemperatur (nutzt einen gesetzten Wert oder schätzt ihn aus den letzten Daten).

source: Time-based bands (default)
de: Zeitbasierte Stufen (Standard)

source: Time-based bands use warning/info/normal colors based on remaining time. Status mode uses fixed colors for heating, cooling, and idle.
de: Zeitbasierte Stufen verwenden Warn-/Info-/Normalfarben basierend auf der verbleibenden Zeit. Der Statusmodus verwendet feste Farben für Heizen, Abkühlen und Leerlauf.

source: Timeout (seconds)
de: Timeout (Sekunden)

source: Tip: In OctoPrint Settings → Appearance you can enable “Show temperatures in Fahrenheit as well as Celsius”. This plugin can also override that via the dropdown above.
de: Tipp: In OctoPrint unter Einstellungen → Erscheinungsbild kannst du „Temperaturen in Fahrenheit zusätzlich zu Celsius anzeigen“ aktivieren. Dieses Plugin kann das auch über das Dropdown oben überschreiben.

source: Tip: These colors also apply to progress bars in status mode.
de: Tipp: Diese Farben gelten im Statusmodus auch für Fortschrittsbalken.

source: Update & Logging
de: Aktualisierung & Logging

source: Update Interval (seconds)
de: Aktualisierungsintervall (Sekunden)

source: Use OctoPrint appearance setting
de: OctoPrint-Einstellung übernehmen

source: Use TLS/SSL
de: TLS/SSL verwenden

source: Used when a heater is actively heating (status color mode).
de: Wird verwendet, wenn ein Heizer aktiv aufheizt (Status-Farbmodus).

source: Used when a heater is cooling down (status color mode).
de: Wird verwendet, wenn ein Heizer abkühlt (Status-Farbmodus).

source: Username
de: Benutzername

source: Volume
de: Lautstärke

source: Watch the estimated time remaining for your printer to heat up the bed, hotend, or chamber.
de: Sieh die geschätzte verbleibende Zeit, bis dein Drucker Bett, Hotend oder Kammer aufgeheizt hat.

source: Why do I see --:--?
de: Warum sehe ich --:--?

source: Write additional debug information to the OctoPrint log (may be noisy)
de: Zusätzliche Debug-Informationen ins OctoPrint-Log schreiben (kann sehr ausführlich sein)

source: {heater}: cooled down to {target}
de: {heater}: abgekühlt auf {target}

source: {heater}: reached {target}
de: {heater}: Ziel erreicht ({target})
